{
    "stories": [
    
        {
            "name": "Frederick Cyril Driffill",
            "servicenumber": "TZ/2343<br>Royal Navy Volunteer Reserve, Hawke Battalion",
            "story": "<p>Able Seaman Frederick “Syd” Cyril was born on 27th August 1881 in Goole, East Yorkshire and enlisted in the Royal Navy Volunteer Reserve service on 12th December 1914, aged 33, when he joined Collingwood Battalion in which he served until June 1915. Following this he served in Anson Battalion in Gallipoli, Nelson Battalion with the British Expeditionary Force (BEF), and finally Hawke Battalion, also with the BEF before sadly being killed in action near Arras on 29th September 1918. His body was never recovered. He was awarded the Military Medal posthumously for “Bravery in the Field” in February 1919. His name can be found on the Vis-en-Artois Memorial.</p>",
            "image": "freddriffill.jpg"
        },
        {
            "name": "John Fergusson Bruce Fraser",
            "servicenumber": "14158<br>16th Highland Light Infantry",
            "story": "<p>Born in 1898, Private John F B Fraser joined the Highland Light Infantry (HLI) when the call for more troops came in 1915. His battalion was known as “The Boys Brigade” Battalion, as it was made up of former and serving members of the Boys Brigade in and around Glasgow. He fought at the Somme, Beaumont-Hamel, Nieuport, Fayet, Passchendaele, Cambrai, Baupaume, and Amiens. His main role was as a runner, caring for the horses, but he was deeply sad after his beloved horse “Captain” was killed.</p>",
            "image": "johnfraser.jpg"
        },
        {
            "name": "Harry Haycock",
            "servicenumber": "Royal Worcestershire",
            "story": "<p>Private Harry Haycock, born 14 January 1898, served in the Royal Worcestershire Regiment. He came back from the war “remote and never spoke of what he saw”. He remained proud and patriotic to the end.</p>",
            "image": "harryhancock.jpg"
        },
        {
            "name": "Frank Sydney Keeble",
            "servicenumber": "8th Canadian Mounted Rifles",
            "story": "<p>Born on 3rd December 1894, Private Frank Sydney Keeble volunteered for service while living in Canada. He had been sent there as a child by Barnardos as he had been orphaned. He returned to live in Kelvedon, Essex, after the war. He married, and had one son and one daughter. He died just six weeks following the birth of his son in 1923, just 27 years old.</p>",
            "image": "frankkeeble.jpg"
        },
        {
            "name": "Sidney James King",
            "servicenumber": "G29945<br>Second Battalion, The Middlesex Regiment",
            "story": "<p>Sidney James King was born on 3rd June 1883. He survived a gunshot to the knees as well as a gas attack before being invalided out of the army in 1917. He lived with his injuries until 1937.</p>",
            "image": "sidneyking.jpg"
        },
        {
            "name": "George John Page",
            "servicenumber": "81084<br>Royal Field Artillery and Royal Horse Artillery",
            "story": "<p>Born in Erith in 1894, Driver George John Page enlisted in Woolwich, and served in France and Flanders. He is believed to have been killed at the second Ypres, most likely from a Chlorine Gas attack on 3rd May 1915, aged 21. He was awarded 15 Star, Victory, and British Medals. He is commemorated at the Menin Gate.</p>",
            "image": "georgepage.jpg"
        },
        {
            "name": "Arthur Sutton",
            "servicenumber": "5th (City of London) Battalion, London Regiment (London Rifle Brigade)",
            "story": "<p>Arthur joined the 5th (City of London) Battalion, London Regiment (London Rifle Brigade) on the 22nd May 1915. He proceeded to France on 15th October 1915, eventually joining the 1st/5th Battalion, serving in 8th Brigade in the Ypres Salient. Arthur was shot in the leg on the 28th January 1916, and despite having 22 operations to save him from being crippled he struggled with mobility for the rest of his life.</p>",
            "image": "arthursutton.jpg"
        },
        {
            "name": "Benjamin Southwell",
            "servicenumber": "SE/2264<br>Royal Veterinary Corps",
            "story": "<p>Private Benjamin Southwell served in Le Harve tending the horses, mules, and pigeons, during World War One. His great, great, grand daughter is now completing her veterinary training.</p>",
            "image": "bensouthwell.jpg"
        }
    ]
}